Ran Plan for 4 projects:

1. dir: `terraform/gp_2134/global/acm` workspace: `default`
1. dir: `terraform/gp_2134/global/ec2` workspace: `default`
1. dir: `terraform/gp_2134/global/vpc` workspace: `default`
1. dir: `terraform/np_5455/global/vpc` workspace: `default`

### 1. dir: `terraform/gp_2134/global/acm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
- destroy

Terraform will perform the following actions:

  # aws_vpc.vpc_network_3 will be destroyed
  # (because aws_vpc.vpc_network_3 is not in configuration)
- resource "aws_vpc" "vpc_network_3" {
      - arn                                  = "arn:aws:ec2:ap-east-1:651482608654:vpc/vpc-0b85b178ae828f0de" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0d81a07fda2fb3f9c" -> null
      - default_route_table_id               = "rtb-093a343ce83453999" -> null
      - default_security_group_id            = "sg-05bf507e1c2d74e9e" -> null
      - dhcp_options_id                      = "dopt-0e4a0664693427690" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0b85b178ae828f0de" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-093a343ce83453999" -> null
      - owner_id                             = "651482608654" -> null
      - tags                                 = {
          - "Name" = "terraform-network-4"
        } -> null
      - tags_all                             = {
          - "Name" = "terraform-network-4"
        } -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/gp_2134/global/acm`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-c6d798b9cb-1522425131.us-east-1.elb.amazonaws.com/lock?id=mileslee-nsuslab%252Fatlantis-test-miles%252Fterraform%252Fgp_2134%252Fglobal%252Facm%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/gp_2134/global/acm`
</details>
Plan: 0 to add, 0 to change, 1 to destroy.

---
### 2. dir: `terraform/gp_2134/global/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_vpc.vpc_network2 will be updated in-place
~ resource "aws_vpc" "vpc_network2" {
        id                                   = "vpc-0f4040439d6e05330"
      ~ tags                                 = {
          ~ "Name" = "terraform-network-np2" -> "terraform-network"
        }
      ~ tags_all                             = {
          ~ "Name" = "terraform-network-np2" -> "terraform-network"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_vpc.vpc_network3 will be created
+ resource "aws_vpc" "vpc_network3" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network"
        }
      + tags_all                             = {
          + "Name" = "terraform-network"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/gp_2134/global/ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-c6d798b9cb-1522425131.us-east-1.elb.amazonaws.com/lock?id=mileslee-nsuslab%252Fatlantis-test-miles%252Fterraform%252Fgp_2134%252Fglobal%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/gp_2134/global/ec2`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
### 3. dir: `terraform/gp_2134/global/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
- destroy

Terraform will perform the following actions:

  # aws_vpc.vpc_network will be destroyed
  # (because aws_vpc.vpc_network is not in configuration)
- resource "aws_vpc" "vpc_network" {
      - arn                                  = "arn:aws:ec2:us-east-1:651482608654:vpc/vpc-03390cb4487293828" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-014b9c032063d1d5c" -> null
      - default_route_table_id               = "rtb-0acc630eea1eac39d" -> null
      - default_security_group_id            = "sg-01190f11c6aa00189" -> null
      - dhcp_options_id                      = "dopt-04bf7d164edea6d38" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-03390cb4487293828" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0acc630eea1eac39d" -> null
      - owner_id                             = "651482608654" -> null
      - tags                                 = {
          - "Name" = "terraform-network"
        } -> null
      - tags_all                             = {
          - "Name" = "terraform-network"
        } -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/gp_2134/global/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-c6d798b9cb-1522425131.us-east-1.elb.amazonaws.com/lock?id=mileslee-nsuslab%252Fatlantis-test-miles%252Fterraform%252Fgp_2134%252Fglobal%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/gp_2134/global/vpc`
</details>
Plan: 0 to add, 0 to change, 1 to destroy.

---
### 4. dir: `terraform/np_5455/global/vpc` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform init -input=false -upgrade" in "/atlantis-data/repos/mileslee-nsuslab/atlantis-test-miles/3/default/terraform/np_5455/global/vpc": exit status 1

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "5.24.0"...
- Installing hashicorp/aws v5.24.0...
╷
│ Error: Failed to install provider
│ 
│ Error while installing hashicorp/aws v5.24.0: failed to make target path
│ .terraform/providers/registry.terraform.io/hashicorp/aws/5.24.0/linux_amd64
│ absolute: getwd: no such file or directory
╵


```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`